## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| add    | `aws_route53_record.notification-alt-root-WC[0]` |
|        | `aws_route53_record.notification-alt-root[0]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.notification-alt-root[0] will be created
  + resource "aws_route53_record" "notification-alt-root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.alpha.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.notification-alt-root-WC[0] will be created
  + resource "aws_route53_record" "notification-alt-root-WC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.staging.alpha.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
